
## Plan Result (terraform/cloudflare/b0xp.io/portfolio)

[CI link](https://github.com/boxp/arch/actions/runs/8785078602)


<pre><code>Plan: 1 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * cloudflare_record.top
* Update
  * cloudflare_record.www


<details><summary>Change Result (Click me)</summary>

```hcl

  # cloudflare_record.top will be created
  + resource "cloudflare_record" "top" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "@"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = (known after apply)
      + type            = "CNAME"
      + value           = "shanghai-4t4.pages.dev"
      + zone_id         = "ec593206d0ef695c3aae3a4cb3173264"
    }

  # cloudflare_record.www will be updated in-place
  ~ resource "cloudflare_record" "www" {
        id              = "e1081e7dbbbf320fb77c6f32a0db0939"
        name            = "www"
      ~ proxied         = false -> true
        tags            = []
        # (10 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.
```

</details>




## :warning: Errors

* add a label terraform/cloudflare/b0xp.io/portfolio/add-or-update: POST https://api.github.com/repos/boxp/arch/issues/281/labels: 422 Validation Failed [{Resource:Label Field:name Code:invalid Message:}]
<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":281,"Program":"tfcmt","SHA1":"4f64d2d720afdb85c8e949ecf8d04c457019dd98","Target":"terraform/cloudflare/b0xp.io/portfolio","Vars":{},"WorkflowName":"pull_request_target"} -->